[
  {
    "job_title": "2026 KPMG Graduate Program (Rolling Intake)",
    "company": "KPMGau",
    "location": {
      "country": "Australia",
      "city": "National",
      "display": "National, Australia"
    },
    "job_level": "",
    "job_type": "Full-time",
    "job_description": "<p>&nbsp;</p><b>Job Description</b><p>&nbsp;</p><strong>About the Graduate program </strong><p>&nbsp;</p><ul><li>For students in their final year of study in 2025 or recently graduated and not yet in professional work   </li><li>A one year grow pathway with targeted coaching, support and development as you grow your new career </li><li>Real work from the start so you can make an impact and learn straightaway </li><li>Start work in February 2026 (typically, some teams have a slightly different schedule) with a full time and ongoing graduate role.  </li></ul><p>&nbsp;</p><strong>One program. Many specialisations.</strong> <p>&nbsp;</p>We have teams who can work on just about any challenge, from tax compliance and business reporting to public policy improvements and cyber incidents and so much more. Graduate roles are available across a huge variety of areas and we recruit across many degree types, including accounting, law, engineering, data science, and business management, just to name a few. When you apply, you can select areas of work you're interested in that align with your studies and interests. <p>&nbsp;</p>Explore the types of work you could do in more detail.  <p>&nbsp;</p><strong>Location of this job: </strong>nominate your KPMG office location during the application process. <p>&nbsp;</p><strong>What graduates say </strong><p>&nbsp;</p>From day one I've been involved in real client work alongside a wonderful and friendly team who are more than happy to share their knowledge base and expertise with me. (Emily, 2024 graduate)  <p>&nbsp;</p>It's been such a caring environment, and no matter how junior or senior someone is, they are always willing to help you out. (Jordan, 2024 graduate)  <p>&nbsp;</p>Learning about the workings of the world and having the tools and skills to develop viable solutions for all sorts of problems is why I love my job. (Kanwal, 2023 graduate)  <p>&nbsp;</p>I already get to work directly with company CFOs and management to help with accounting practices. (Andrew, 2023 graduate)  <p>&nbsp;</p><strong>Big things on offer</strong> <p>&nbsp;</p><ul><li>Direct support: An experienced 'buddy' will help you settle in and you'll always have a dedicated Performance Development Manager focussed on helping you grow professionally. </li><li>Skills and career development: apply your knowledge to real world problems with a supportive and experienced team around you, plus structured regular learning sessions to strengthen your skills. </li><li>A firm with true commitment to wellbeing, diversity and community: our progress on 21 public commitments is tracked regularly in our  Impact Plan , such as our gender pay gap, indigenous inclusion, mental health, learning and more </li><li>Employee discounts: at 100s of stores (like JB HiFi, Woolworths, Airbnb and more) with our SmartSpend app. </li><li>Build your network, friendships and interests: clubs for a variety of interests from running to books, cooking, badminton, video games and so much more. </li></ul><p>&nbsp;</p><strong>Ready to apply? </strong><p>&nbsp;</p>Get started now with the 5-minute application form. <p>&nbsp;</p><li>Complete your details </li><li>Select the graduate program </li><li>Select which area/s you'd like to join (you can select multiple areas - no need to complete multiple application forms) </li> <p>&nbsp;</p>During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact our  Talent Attraction Support Team .<p>&nbsp;</p><strong>About rolling intake:</strong> We run two rounds of recruitment: main intake (now closed) and rolling intake. We aim to fill as many of our roles as possible through the main intake but, of course, things change and new roles come up. Applying to the rolling intake means your application will be reviewed as a suitable role comes up (and it does happen!).",
    "apply_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000334081-2026-kpmg-graduate-program-rolling-intake-"
  }
]