{
  "no of jobs": 185,
  "offset": 0,
  "limit": 3,
  "data": [
    {
      "id": "-127436673",
      "application_email": "",
      "application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000334081-2026-kpmg-graduate-program-rolling-intake-",
      "company": "KPMGau",
      "contact_email": "",
      "contact_name": "",
      "contact_telephone": "",
      "contact_url": "",
      "internal_application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000334081-2026-kpmg-graduate-program-rolling-intake-",
      "job_description": "<p>&nbsp;</p><b>Job Description</b><p>&nbsp;</p><strong>About the Graduate program </strong><p>&nbsp;</p><ul><li>For students in their final year of study in 2025 or recently graduated and not yet in professional work   </li><li>A one year grow pathway with targeted coaching, support and development as you grow your new career </li><li>Real work from the start so you can make an impact and learn straightaway </li><li>Start work in February 2026 (typically, some teams have a slightly different schedule) with a full time and ongoing graduate role.  </li></ul><p>&nbsp;</p><strong>One program. Many specialisations.</strong> <p>&nbsp;</p>We have teams who can work on just about any challenge, from tax compliance and business reporting to public policy improvements and cyber incidents and so much more. Graduate roles are available across a huge variety of areas and we recruit across many degree types, including accounting, law, engineering, data science, and business management, just to name a few. When you apply, you can select areas of work you're interested in that align with your studies and interests. <p>&nbsp;</p>Explore the types of work you could do in more detail.  <p>&nbsp;</p><strong>Location of this job: </strong>nominate your KPMG office location during the application process. <p>&nbsp;</p><strong>What graduates say </strong><p>&nbsp;</p>From day one I've been involved in real client work alongside a wonderful and friendly team who are more than happy to share their knowledge base and expertise with me. (Emily, 2024 graduate)  <p>&nbsp;</p>It's been such a caring environment, and no matter how junior or senior someone is, they are always willing to help you out. (Jordan, 2024 graduate)  <p>&nbsp;</p>Learning about the workings of the world and having the tools and skills to develop viable solutions for all sorts of problems is why I love my job. (Kanwal, 2023 graduate)  <p>&nbsp;</p>I already get to work directly with company CFOs and management to help with accounting practices. (Andrew, 2023 graduate)  <p>&nbsp;</p><strong>Big things on offer</strong> <p>&nbsp;</p><ul><li>Direct support: An experienced 'buddy' will help you settle in and you'll always have a dedicated Performance Development Manager focussed on helping you grow professionally. </li><li>Skills and career development: apply your knowledge to real world problems with a supportive and experienced team around you, plus structured regular learning sessions to strengthen your skills. </li><li>A firm with true commitment to wellbeing, diversity and community: our progress on 21 public commitments is tracked regularly in our  Impact Plan , such as our gender pay gap, indigenous inclusion, mental health, learning and more </li><li>Employee discounts: at 100s of stores (like JB HiFi, Woolworths, Airbnb and more) with our SmartSpend app. </li><li>Build your network, friendships and interests: clubs for a variety of interests from running to books, cooking, badminton, video games and so much more. </li></ul><p>&nbsp;</p><strong>Ready to apply? </strong><p>&nbsp;</p>Get started now with the 5-minute application form. <p>&nbsp;</p><li>Complete your details </li><li>Select the graduate program </li><li>Select which area/s you'd like to join (you can select multiple areas - no need to complete multiple application forms) </li> <p>&nbsp;</p>During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact our  Talent Attraction Support Team .<p>&nbsp;</p><strong>About rolling intake:</strong> We run two rounds of recruitment: main intake (now closed) and rolling intake. We aim to fill as many of our roles as possible through the main intake but, of course, things change and new roles come up. Applying to the rolling intake means your application will be reviewed as a suitable role comes up (and it does happen!).",
      "job_function": "",
      "job_industry": "Accounting/Auditing",
      "job_level": "",
      "job_location_city": "National",
      "job_location_country": "Australia",
      "job_location_display": "National, Australia",
      "job_location_postalcode": null,
      "job_location_state": "",
      "job_reference": "6000000000334081",
      "job_region": "ASPAC",
      "job_service": "",
      "job_skills": "",
      "job_title": "2026 KPMG Graduate Program (Rolling Intake)",
      "job_type": "Full-time",
      "job_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000334081-2026-kpmg-graduate-program-rolling-intake-",
      "raw_function": "",
      "salary_benefits": "",
      "salary_currency": "",
      "salary_from": "",
      "salary_per": "",
      "salary_to": "",
      "SN": null,
      "source": "Broadbean"
    },
    {
      "id": "-127436659",
      "application_email": "",
      "application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333723-tax-manager-to-director-",
      "company": "KPMGau",
      "contact_email": "",
      "contact_name": "",
      "contact_telephone": "",
      "contact_url": "",
      "internal_application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333723-tax-manager-to-director-",
      "job_description": "<p>&nbsp;</p><b>Job Description</b><p>&nbsp;</p>At KPMG Australia, we work with some of the most exciting, innovative and important businesses in Australia. We have entered an exciting period of growth and we are looking for incredible and diverse individuals to join our supportive team.<p>&nbsp;</p><strong>Your Opportunity</strong><p>&nbsp;</p>We currently have exciting opportunities for Manager, Senior Managers and Directors across our Tax division.<p>&nbsp;</p>Corporate Tax Advisory/Corporate Tax DDX <p>&nbsp;</p>Our Corporate Tax division helps businesses understand corporate tax matters and comply with ATO filing obligations. We recognise that multinational businesses face obstacles in managing tax across different jurisdictions and we use our local and global expertise to cut through the complexity this entails. <p>&nbsp;</p>M&A Tax/Stamp Duty <p>&nbsp;</p>The KPMG State Tax Deals and Stamp Duty teams work on the most significant transactions in the Australian Market. They are market leading teams supporting clients with tax due diligence, structuring, modelling, duty and land tax compliance and dispute resolutions.<p>&nbsp;</p>GST Advisory/GST DDX/Employment Tax/Payroll/Trade & Customs <p>&nbsp;</p>Our Indirect Tax division within the KPMG Specialist Tax and Reward business consists of market leading teams that provide high-touch, value-add advisory and compliance services. We support clients across the market through consulting on FBT, payroll tax, superannuation obligations, GST advice and international trade strategy.<p>&nbsp;</p>GMS Tax Advisory/GMS DDX <p>&nbsp;</p>Our Global Mobility Services teams are part of the KPMG People Services business in Australia and offers both Australian and international tax services to clients. We work across all areas of Global Mobility and related tax matters providing a high-touch, value-add advisory and compliance services to our clients.<p>&nbsp;</p>Performance & Reward <p>&nbsp;</p>KPMG's Performance & Reward team is our leading remuneration practice advising ASX200 and unlisted company Boards and C-Site on remuneration and reward issues. We help our clients implement remuneration plans to reward and retain their people.<p>&nbsp;</p>Migration DDX <p>&nbsp;</p>Our national immigration practice is a team of registered migration agents and administrators that manage the visa requirements involved in the relocation of individuals and their families from one country to another by working closely with taxation specialists and global mobility professionals.<p>&nbsp;</p>Transfer Pricing <p>&nbsp;</p>Our Transfer Pricing Services practice is an international team of economists, tax practitioners and analysts helping clients generate tax efficiencies and reduce the risk of challenges from revenue authorities. Our multi-disciplinary approach and global mindset enable us to cover issues such as developing and executing commercially viable transfer pricing policies, compiling documentation for revenue authority audits and complying with local revenue requirements.<p>&nbsp;</p>Tax Governance & Transparency <p>&nbsp;</p>The Tax Governance & Transparency team advises organisations nationally and internationally on better practices in respect of tax governance and sustainability through tax transparency and risk management disciplines.<p>&nbsp;</p>Tax Reimagined <p>&nbsp;</p>Our Tax Transformation team assist clients in transforming their tax functions to increase efficiency, improve governance and accuracy of their tax reporting.<p>&nbsp;</p>Tax Controversy <p>&nbsp;</p>Our Tax Controversy team complements KPMG's traditional service offerings by providing high-quality legal services to our clients. The team prepare for, manage and resolve tax disputes, whilst maintaining an effective working relationship with revenue authorities.<p>&nbsp;</p><strong>How are you extraordinary?</strong><p>&nbsp;</p><ul><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines</li><li>You actively seek out opportunities for growth, are comfortable challenging the status quo, and enjoy getting out of your comfort zone</li><li>You resonate with our values and are excited to contribute to our culture of integrity, excellence, and collaboration.</li></ul><p>&nbsp;</p><strong>Your Experience</strong><p>&nbsp;</p>At KPMG, we believe diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients, and communities. To be considered for this opportunity, your qualifications, skills & experience could include:<p>&nbsp;</p>Corporate Tax Advisory/Corporate Tax DDX <p>&nbsp;</p><ul><li>Advisory and compliance experience</li><li>High level of commitment to quality client service</li><li>Preferably CA/CPA qualified or with a Master's of Taxation.</li></ul><p>&nbsp;</p>M&A Tax/Stamp Duty <p>&nbsp;</p><ul><li>Demonstrated experience as a Finance/Accounting/Law professional, ideally with significant recent experience in duty in an M&A/ transactional tax environment</li><li>You are passionate about the importance of fantastic communication to share ideas, inspire and create change. You are able to digest, distil, and communicate complex concepts in both written and verbal forms.</li></ul><p>&nbsp;</p>GST Advisory/GST DDX/Employment Tax/Payroll/Trade & Customs <p>&nbsp;</p><ul><li>A degree in Accounting, Commerce or other relevant disciplines</li><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines</li><li>You are analytically minded and enjoy applying structured thinking and analysis techniques to complex problems.</li></ul><p>&nbsp;</p>GMS Tax Advisory/GMS DDX <p>&nbsp;</p><ul><li>Experience with expatriate tax compliance issues, with strong Tax compliance knowledge, including preparation and/or review of company and trust income tax returns, distribution reviews and tax provisions</li><li>An honest and ethical approach to business which will provide a natural fit with KPMG's values.</li></ul><p>&nbsp;</p>Performance & Reward <p>&nbsp;</p><ul><li>A broad mix of technical knowledge suited to working in the Leadership, Performance and Reward space</li><li>Sector experience within consulting, a large listed corporate, or government</li><li>You like to be proud of the work you produce and are accountable and committed to owning high-profile projects.</li></ul><p>&nbsp;</p>Migration DDX <p>&nbsp;</p><ul><li>Must be a Registered Migration Agent with sound understanding of migration legislation in a high-volume environment</li><li>You are committed to providing fantastic customer service, with kindness and empathy at the heart of every interaction.</li></ul><p>&nbsp;</p>Transfer Pricing <p>&nbsp;</p><ul><li>Prior transfer pricing experience in a Big 4 or mid-tier firm, the ATO or corporate environment</li><li>A degree in Accounting, Economics, Commerce, Finance or Law, and/or undertaking/completion of the CA/CPA</li><li>You resonate with our values and are excited to contribute to or culture of integrity, excellence and collaboration.</li></ul><p>&nbsp;</p>Tax Governance & Transparency <p>&nbsp;</p><ul><li>Tertiary qualifications in a related discipline such as Business, Tax, Law, Audit or Finance / Commerce</li><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines.</li></ul><p>&nbsp;</p>Tax Reimagined <p>&nbsp;</p><ul><li>A tertiary qualification (preferably Finance/Accounting and/or Maths/ Computer Science related) will be viewed favourably, with previous Indirect Tax Technology implementation experience</li><li>Expertise in defining and/or configuring tax logic and content within third-party tax solutions (ONESOURCE, Vertex or equivalent)</li><li>ERP Technology implementation experience (preferably SAP, Oracle, Workday or NetSuite) - ideally in Tax</li><li>You actively seek out opportunities for growth, are comfortable challenging the status quo, and enjoy getting out of your comfort zone.</li></ul><p>&nbsp;</p>Tax Controversy <p>&nbsp;</p><ul><li>Previous experience in corporate tax, international tax, tax law and/or tax dispute resolution and controversy in either a Big 4 professional services firm, a law firm or the Australian Taxation Office.</li><li>Ability to quickly establish a high level of stakeholder engagement, and able to hold the role of an advisor to the business and be an expert on a topical area(s) of tax law</li><li>Ability to integrate information from a variety of different sources, consider the broader impact of issues and how it will affect the project, engagement and the business</li></ul><p>&nbsp;</p>Please note, the salary ranges $100k - $255k+ with respect to your level of experience.<p>&nbsp;</p>We are hiring for the following employment types: Casual, Max-Term Full Time, Max-Term Part Time, Permanent Full Time & Permanent Part Time.<p>&nbsp;</p>We also have offices in the following locations:<p>&nbsp;</p><ul><li>Sydney</li><li>Melbourne</li><li>Brisbane</li><li>Perth</li><li>Canberra</li><li>Adelaide</li><li>Hobart</li><li>Gold Coast</li><li>Darwin</li><li>Townsville</li><li>Parramatta</li><li>Wollongong</li><li>Newcastle/Hunter Region</li><li>Geelong</li></ul><p>&nbsp;</p><b>Qualifications</b><p>&nbsp;</p>Specific qualifications are mentioned above<p>&nbsp;</p><b>Additional Information</b><p>&nbsp;</p>KPMG is a professional services firm with global outreach and deep sector experience. We work with clients across an array of industries to solve complex challenges, steer change and enable growth. <br><br>Our people are what make KPMG the thriving workplace that it is and what sets us apart is that we know great minds think differently. Collaborate with a team of passionate, highly skilled professionals who've got your back. You'll build relationships with unique and diverse colleagues who will provide you with the support you need to be your best and produce meaningful and impactful work in an inclusive, equitable culture.<br><br>At KPMG, you'll take control over how you work. We're embracing a new way of working in many ways, from offering flexible hours and locations to generous paid parental leave and career breaks. Our people enjoy a variety of exciting perks, including retail discounts, health and wellbeing initiatives, learning and growth opportunities, salary packaging options and more.<br><br>Diverse candidates have diverse needs. During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact the  Talent Attraction Support Team .<br><br><strong> At KPMG every career is different, and we look forward to seeing how you grow with us. </strong>",
      "job_function": "",
      "job_industry": "Business Development",
      "job_level": "",
      "job_location_city": "Sydney",
      "job_location_country": "Australia",
      "job_location_display": "Sydney, NSW, Australia",
      "job_location_postalcode": null,
      "job_location_state": "NSW",
      "job_reference": "6000000000333723",
      "job_region": "ASPAC",
      "job_service": "",
      "job_skills": "",
      "job_title": "Tax - Manager to Director",
      "job_type": "Full-time",
      "job_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333723-tax-manager-to-director-",
      "raw_function": "",
      "salary_benefits": "",
      "salary_currency": "",
      "salary_from": "100000.00",
      "salary_per": "annum",
      "salary_to": "",
      "SN": null,
      "source": "Broadbean"
    },
    {
      "id": "-127436630",
      "application_email": "",
      "application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333710-tax-consultant-to-senior-consultant-",
      "company": "KPMGau",
      "contact_email": "",
      "contact_name": "",
      "contact_telephone": "",
      "contact_url": "",
      "internal_application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333710-tax-consultant-to-senior-consultant-",
      "job_description": "<p>&nbsp;</p><b>Job Description</b><p>&nbsp;</p>At KPMG Australia, we work with some of the most exciting, innovative and important businesses in Australia. We have entered an exciting period of growth and we are looking for incredible and diverse individuals to join our supportive team.<p>&nbsp;</p><strong>Your Opportunity</strong><p>&nbsp;</p>We currently have opportunities for Consultants and Senior Consultants across our Tax divisions.<p>&nbsp;</p>Corporate Tax Advisory/Corporate Tax DDX <p>&nbsp;</p>Our Corporate Tax division helps businesses understand corporate tax matters and comply with ATO filing obligations. We recognise that multinational businesses face obstacles in managing tax across different jurisdictions and we use our local and global expertise to cut through the complexity this entails. <p>&nbsp;</p>M&A Tax/Stamp Duty <p>&nbsp;</p>The KPMG State Tax Deals and Stamp Duty teams work on the most significant transactions in the Australian Market. They are market leading teams supporting clients with tax due diligence, structuring, modelling, duty and land tax compliance and dispute resolutions.<p>&nbsp;</p>GST Advisory/GST DDX/Employment Tax/Payroll/Trade & Customs <p>&nbsp;</p>Our Indirect Tax division within the KPMG Specialist Tax and Reward business consists of market leading teams that provide high-touch, value-add advisory and compliance services. We support clients across the market through consulting on FBT, payroll tax, superannuation obligations, GST advice and international trade strategy.<p>&nbsp;</p>GMS Tax Advisory/GMS DDX <p>&nbsp;</p>Our Global Mobility Services teams are part of the KPMG People Services business in Australia and offers both Australian and international tax services to clients. We work across all areas of Global Mobility and related tax matters providing a high-touch, value-add advisory and compliance services to our clients.<p>&nbsp;</p>Performance & Reward <p>&nbsp;</p>KPMG's Performance & Reward team is our leading remuneration practice advising ASX200 and unlisted company Boards and C-Site on remuneration and reward issues. We help our clients implement remuneration plans to reward and retain their people.<p>&nbsp;</p>Migration DDX <p>&nbsp;</p>Our national immigration practice is a team of registered migration agents and administrators that manage the visa requirements involved in the relocation of individuals and their families from one country to another by working closely with taxation specialists and global mobility professionals.<p>&nbsp;</p>Transfer Pricing <p>&nbsp;</p>Our Transfer Pricing Services practice is an international team of economists, tax practitioners and analysts helping clients generate tax efficiencies and reduce the risk of challenges from revenue authorities. Our multi-disciplinary approach and global mindset enable us to cover issues such as developing and executing commercially viable transfer pricing policies, compiling documentation for revenue authority audits and complying with local revenue requirements.<p>&nbsp;</p>Tax Governance & Transparency <p>&nbsp;</p>The Tax Governance & Transparency team advises organisations nationally and internationally on better practices in respect of tax governance and sustainability through tax transparency and risk management disciplines.<p>&nbsp;</p>Tax Reimagined <p>&nbsp;</p>Our Tax Transformation team assist clients in transforming their tax functions to increase efficiency, improve governance and accuracy of their tax reporting.<p>&nbsp;</p>Tax Controversy <p>&nbsp;</p>Our Tax Controversy team complements KPMG's traditional service offerings by providing high-quality legal services to our clients. The team prepare for, manage and resolve tax disputes, whilst maintaining an effective working relationship with revenue authorities.<p>&nbsp;</p><strong>How are you extraordinary?</strong><p>&nbsp;</p><ul><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines</li><li>You actively seek out opportunities for growth, are comfortable challenging the status quo, and enjoy getting out of your comfort zone</li><li>You resonate with our values and are excited to contribute to our culture of integrity, excellence, and collaboration.</li></ul><p>&nbsp;</p><strong>Your Experience</strong><p>&nbsp;</p>At KPMG, we believe diversity of thought, background and experience strengthens relationships and delivers meaningful benefits to our people, our clients, and communities. To be considered for this opportunity, your qualifications, skills & experience could include:<p>&nbsp;</p>Corporate Tax Advisory/Corporate Tax DDX <p>&nbsp;</p><ul><li>Advisory and compliance experience</li><li>High level of commitment to quality client service</li><li>Preferably CA/CPA qualified or with a Master's of Taxation.</li></ul><p>&nbsp;</p>M&A Tax/Stamp Duty <p>&nbsp;</p><ul><li>Demonstrated experience as a Finance/Accounting/Law professional, ideally with significant recent experience in duty in an M&A/ transactional tax environment</li><li>You are passionate about the importance of fantastic communication to share ideas, inspire and create change. You are able to digest, distil, and communicate complex concepts in both written and verbal forms.</li></ul><p>&nbsp;</p>GST Advisory/GST DDX/Employment Tax/Payroll/Trade & Customs <p>&nbsp;</p><ul><li>A degree in Accounting, Commerce or other relevant disciplines</li><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines</li><li>You are analytically minded and enjoy applying structured thinking and analysis techniques to complex problems.</li></ul><p>&nbsp;</p>GMS Tax Advisory/GMS DDX <p>&nbsp;</p><ul><li>Experience with expatriate tax compliance issues, with strong Tax compliance knowledge, including preparation and/or review of company and trust income tax returns, distribution reviews and tax provisions</li><li>An honest and ethical approach to business which will provide a natural fit with KPMG's values.</li></ul><p>&nbsp;</p>Performance & Reward <p>&nbsp;</p><ul><li>A broad mix of technical knowledge suited to working in the Leadership, Performance and Reward space</li><li>Sector experience within consulting, a large listed corporate, or government</li><li>You like to be proud of the work you produce and are accountable and committed to owning high-profile projects.</li></ul><p>&nbsp;</p>Migration DDX <p>&nbsp;</p><ul><li>Must be a Registered Migration Agent with sound understanding of migration legislation in a high-volume environment</li><li>You are committed to providing fantastic customer service, with kindness and empathy at the heart of every interaction.</li></ul><p>&nbsp;</p>Transfer Pricing <p>&nbsp;</p><ul><li>Prior transfer pricing experience in a Big 4 or mid-tier firm, the ATO or corporate environment</li><li>A degree in Accounting, Economics, Commerce, Finance or Law, and/or undertaking/completion of the CA/CPA</li><li>You resonate with our values and are excited to contribute to or culture of integrity, excellence and collaboration.</li></ul><p>&nbsp;</p>Tax Governance & Transparency <p>&nbsp;</p><ul><li>Tertiary qualifications in a related discipline such as Business, Tax, Law, Audit or Finance / Commerce</li><li>You enjoy working in the details, with a proactive attitude towards accuracy and deadlines.</li></ul><p>&nbsp;</p>Tax Reimagined <p>&nbsp;</p><ul><li>A tertiary qualification (preferably Finance/Accounting and/or Maths/ Computer Science related) will be viewed favourably, with previous Indirect Tax Technology implementation experience</li><li>Expertise in defining and/or configuring tax logic and content within third-party tax solutions (ONESOURCE, Vertex or equivalent)</li><li>ERP Technology implementation experience (preferably SAP, Oracle, Workday or NetSuite) - ideally in Tax</li><li>You actively seek out opportunities for growth, are comfortable challenging the status quo, and enjoy getting out of your comfort zone.</li></ul><p>&nbsp;</p>Tax Controversy <p>&nbsp;</p><ul><li>Previous experience in corporate tax, international tax, tax law and/or tax dispute resolution and controversy in either a Big 4 professional services firm, a law firm or the Australian Taxation Office.</li><li>Ability to quickly establish a high level of stakeholder engagement, and able to hold the role of an advisor to the business and be an expert on a topical area(s) of tax law</li><li>Ability to integrate information from a variety of different sources, consider the broader impact of issues and how it will affect the project, engagement and the business</li></ul><p>&nbsp;</p>Please note, the salary ranges $60k - $100k+ with respect to your level of experience.<p>&nbsp;</p>We are hiring for the following employment types: Casual, Max-Term Full Time, Max-Term Part Time, Permanent Full Time & Permanent Part Time.<p>&nbsp;</p>We also have offices in the following locations:<p>&nbsp;</p><ul><li>Sydney</li><li>Melbourne</li><li>Brisbane</li><li>Perth</li><li>Canberra</li><li>Adelaide</li><li>Hobart</li><li>Gold Coast</li><li>Darwin</li><li>Townsville</li><li>Parramatta</li><li>Wollongong</li><li>Newcastle/Hunter Region</li><li>Geelong</li></ul><p>&nbsp;</p><b>Qualifications</b><p>&nbsp;</p>Specific qualifications are mentioned above<p>&nbsp;</p><b>Additional Information</b><p>&nbsp;</p>KPMG is a professional services firm with global outreach and deep sector experience. We work with clients across an array of industries to solve complex challenges, steer change and enable growth. <br><br>Our people are what make KPMG the thriving workplace that it is and what sets us apart is that we know great minds think differently. Collaborate with a team of passionate, highly skilled professionals who've got your back. You'll build relationships with unique and diverse colleagues who will provide you with the support you need to be your best and produce meaningful and impactful work in an inclusive, equitable culture.<br><br>At KPMG, you'll take control over how you work. We're embracing a new way of working in many ways, from offering flexible hours and locations to generous paid parental leave and career breaks. Our people enjoy a variety of exciting perks, including retail discounts, health and wellbeing initiatives, learning and growth opportunities, salary packaging options and more.<br><br>Diverse candidates have diverse needs. During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact the  Talent Attraction Support Team .<br><br><strong> At KPMG every career is different, and we look forward to seeing how you grow with us. </strong>",
      "job_function": "",
      "job_industry": "Business Development",
      "job_level": "",
      "job_location_city": "Sydney",
      "job_location_country": "Australia",
      "job_location_display": "Sydney, NSW, Australia",
      "job_location_postalcode": null,
      "job_location_state": "NSW",
      "job_reference": "6000000000333710",
      "job_region": "ASPAC",
      "job_service": "",
      "job_skills": "",
      "job_title": "Tax - Consultant to Senior Consultant",
      "job_type": "Full-time",
      "job_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000333710-tax-consultant-to-senior-consultant-",
      "raw_function": "",
      "salary_benefits": "",
      "salary_currency": "",
      "salary_from": "60000.00",
      "salary_per": "annum",
      "salary_to": "100000.00",
      "SN": null,
      "source": "Broadbean"
    }
  ]
}