[
  {
    "id": "1858395990",
    "application_email": "",
    "application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000340785-consultant-indirect-tax-compliance-",
    "company": "KPMGau",
    "contact_email": "",
    "contact_name": "",
    "contact_telephone": "",
    "contact_url": "",
    "internal_application_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000340785-consultant-indirect-tax-compliance-",
    "job_description": "<b>Company Description</b><p>&nbsp;</p>To assist the Indirect Tax compliance team in the ongoing management of client indirect tax reporting to the Australian Taxation Office (ATO). Key to your success in this role will be your ability to assist the team to provide accurate and timely support to our standardised and compliance-based services. You will develop relationships with clients, KPMG services teams and offshore partners, as well as act as a point of liaison with the ATO on behalf of the client. <p>&nbsp;</p><strong>Your Opportunity</strong><p>&nbsp;</p><ul><li>Work as part of a dynamic team dealing with complex tax arrangements, and contribute to a range of complex client engagement activities</li><li>Deliver high quality, technically accurate outputs on a timely basis</li><li>Prepare, review and lodge activity statement for clients</li><li>Leverage KPMG tools and technology to provide value added services across a range of core services </li><li>Establish and support continuous improvement initiatives in compliance, accounting procedures and standard processing based activities</li><li>Seek out opportunities to ensure a full understanding of client on-boarding and risk procedures and contribute where appropriate</li><li>Actively build own capability to increase and diversify technical skills</li><li>Draft client advice for review, and applying your strong problem-solving skills, analytical skills and delivering actionable insights</li><li>Identifying emerging trends and best practices for our clients industry by monitoring economic, legislative, management and social forces in the national and global environment</li></ul><p>&nbsp;</p><strong>How are you Extraordinary?</strong><p>&nbsp;</p><ul><li>Working knowledge of GST legislation and strong understanding of reporting requirements</li><li>Experience in compliance and GST consulting desirable</li><li>Ability to navigate various systems, and a strong understanding of processes and controls that are relevant to the preparation of activity statements</li><li>Degree in tax, accounting, commerce or law</li><li>Experience in the tax, accounting or law fields</li><li>Willingly shares information and work with peers to streamline processes and create efficiencies</li><li>Strong problem-solving skills, analytical skills, and communication skills</li><li>Ability to deliver high quality, accurate outputs in an efficient manner</li><li>Identify issues and find solutions, communicate with team members and meet set KPI's</li></ul><p>&nbsp;</p><b>Additional Information</b><p>&nbsp;</p>KPMG is a professional services firm with global outreach and deep sector experience. We work with clients across an array of industries to solve complex challenges, steer change and enable growth. <br><br>Our people are what make KPMG the thriving workplace that it is and what sets us apart is that we know great minds think differently. Collaborate with a team of passionate, highly skilled professionals who've got your back. You'll build relationships with unique and diverse colleagues who will provide you with the support you need to be your best and produce meaningful and impactful work in an inclusive, equitable culture.<br><br>At KPMG, you'll take control over how you work. We're embracing a new way of working in many ways, from offering flexible hours and locations to generous paid parental leave and career breaks. Our people enjoy a variety of exciting perks, including retail discounts, health and wellbeing initiatives, learning and growth opportunities, salary packaging options and more.<br><br>Diverse candidates have diverse needs. During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact the  Talent Attraction Support Team .<br><br><strong> At KPMG every career is different, and we look forward to seeing how you grow with us. </strong>",
    "job_function": "",
    "job_industry": "Consulting",
    "job_level": "",
    "job_location_city": "Sydney",
    "job_location_country": "Australia",
    "job_location_display": "Sydney, NSW, Australia",
    "job_location_postalcode": null,
    "job_location_state": "NSW",
    "job_reference": "6000000000340785",
    "job_region": "ASPAC",
    "job_service": "",
    "job_skills": "",
    "job_title": "Consultant - Indirect Tax Compliance",
    "job_type": "Full-time",
    "job_url": "https://jobs.smartrecruiters.com/KPMGAustralia1/6000000000340785-consultant-indirect-tax-compliance-",
    "raw_function": "",
    "salary_benefits": "",
    "salary_currency": "",
    "salary_from": "",
    "salary_per": "",
    "salary_to": "",
    "SN": null,
    "source": "Broadbean"
  }
]